{"keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["dense_4", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, null, null, 3]}}, {"name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv1", "filters": 32, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv1_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv1_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_1", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_1", "inbound_nodes": [[["conv_pad_1", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_dw_1", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_1_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_1_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_1", "filters": 64, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_1_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_1_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_2", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_2", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv_dw_2", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_2_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_2_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_2", "filters": 128, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_2_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_2_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_3", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_3", "inbound_nodes": [[["conv_pad_3", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_dw_3", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_3_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_3_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_3", "filters": 128, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_3_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_3_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_4", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_4", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv_dw_4", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_4_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_4_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_4", "filters": 256, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_4_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_4_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_5", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_5", "inbound_nodes": [[["conv_pad_5", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_dw_5", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_5_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_5_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_5", "filters": 256, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_5_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_5_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_6", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_6", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv_dw_6", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_6_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_6_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_6", "filters": 512, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_6_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_6_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_7", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_7", "inbound_nodes": [[["conv_pad_7", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_dw_7", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_7_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_7_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_7", "filters": 512, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_7_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_7_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_8", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_8", "inbound_nodes": [[["conv_pad_8", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_dw_8", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_8_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_8_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_8", "filters": 512, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_8_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_8_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_9", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_9", "inbound_nodes": [[["conv_pad_9", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_dw_9", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_9_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_9_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_9", "filters": 512, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_9_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_9_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_10", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_10", "inbound_nodes": [[["conv_pad_10", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_dw_10", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_10_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_10_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_10", "filters": 512, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_10_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_10_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_11", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_11", "inbound_nodes": [[["conv_pad_11", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_dw_11", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_11_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_11_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_11", "filters": 512, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_11_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_11_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_12", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_12", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dilation_rate": [1, 1], "name": "conv_dw_12", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_12_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_12_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_12", "filters": 1024, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_12_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_12_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pad_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_13", "padding": [[1, 1], [1, 1]], "trainable": false, "data_format": "channels_last"}}, {"name": "conv_dw_13", "inbound_nodes": [[["conv_pad_13", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"trainable": false, "kernel_size": [3, 3], "depthwise_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_dw_13", "depth_multiplier": 1, "bias_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "depthwise_regularizer": null}}, {"name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_dw_13_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_13_relu", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": false, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv_pw_13", "filters": 1024, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear"}}, {"name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "trainable": false, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "name": "conv_pw_13_bn", "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "axis": -1}}, {"name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_13_relu", "trainable": false, "activation": "relu6"}}, {"name": "global_average_pooling2d_1", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": false, "data_format": "channels_last"}}, {"name": "dense_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "units": 1024, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu"}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "units": 1024, "activity_regularizer": null, "name": "dense_2", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu"}}, {"name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "units": 512, "activity_regularizer": null, "name": "dense_3", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu"}}, {"name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "units": 6, "activity_regularizer": null, "name": "dense_4", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "softmax"}}]}}